Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
ay_method._: Refreshing state... [id=agm-auudf51p4c-fljl4i4t93-OPTIONS]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-auudf51p4c-9gfn10-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples: Refreshing state... [id=agmr-auudf51p4c-3vivi6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.entry_types: Refreshing state... [id=agir-auudf51p4c-5o3l4j-GET-200]
module.sbeacon.aws_api_gateway_integration_response.root-get: Refreshing state... [id=agir-auudf51p4c-fljl4i4t93-GET-200]
module.svep[0].aws_lambda_permission.plugin_clinvar_invoke_permission: Refreshing state... [id=SNSPluginClinvarAllowInvoke]
module.svep[0].aws_sns_topic_subscription.pluginClinvar: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginClinvar:ca9c0900-9b0f-411d-9104-9fc5373cf1d7]
module.svep[0].aws_sns_topic_subscription.formatOutput: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-formatOutput:02cc322c-2322-4bbf-9263-7bd36ee9c6f3]
module.svep[0].aws_lambda_permission.formatOutput_invoke_permission: Refreshing state... [id=SNSformatOutputAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.query_vcf_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.query_vcf_invoke_permission: Refreshing state... [id=SNSQueryVCFAllowInvoke]
module.svep[0].aws_sns_topic_subscription.queryVCF: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryVCF:af9a9502-b6c6-477d-a14f-7dd29754a4a2]
module.svep[0].aws_sns_topic_subscription.pluginGnomad: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomad:8dff79b5-d187-4674-a3af-4d5cdabb8e19]
module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_invoke_permission: Refreshing state... [id=SNSPluginGnomadAllowInvoke]
module.svep[0].aws_sns_topic_subscription.concat: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concat:a264b532-73ae-41d0-b3ab-e04ef36f4257]
module.svep[0].aws_lambda_permission.concat_invoke_permission: Refreshing state... [id=SNSConcatAllowInvoke]
module.svep[0].aws_sns_topic_subscription.concatPages: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concatPages:bc17b54c-a2b4-4a58-b6f6-3a445c3ebe65]
module.svep[0].aws_lambda_permission.concat_pages_invoke_permission: Refreshing state... [id=SNSConcatPagesAllowInvoke]
module.svep[0].aws_sns_topic_subscription.pluginGnomadConstraint: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomadConstraint:9b574605-2a70-4e05-a097-2224adb029b2]
module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_constraint_invoke_permission: Refreshing state... [id=SNSPluginGnomadAllowInvoke]
module.svep[0].aws_sns_topic_subscription.concatStarter: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concatStarter:a1ec32e1-39ec-41de-9f30-5f5c9ea598be]
module.svep[0].aws_lambda_function_recursion_config.concat_starter_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.concat_starter_invoke_permission: Refreshing state... [id=SNSConcatStarterAllowInvoke]
module.svep[0].aws_lambda_permission.plugin_send_job_email_invoke_permission: Refreshing state... [id=SNSSendJobEmailAllowInvoke]
module.svep[0].aws_sns_topic_subscription.sendJobEmail: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail:a9b2e92a-3083-4519-a6af-b0727e28ee74]
module.svep[0].aws_api_gateway_integration_response.qcnotes-post: Refreshing state... [id=agir-pihbmfom84-5yb9hf-POST-200]
module.svep[0].aws_api_gateway_integration_response.vcfstats-post: Refreshing state... [id=agir-pihbmfom84-t1qsgu-POST-200]
module.svep[0].aws_api_gateway_integration_response.batch-submit-post: Refreshing state... [id=agir-pihbmfom84-fl7bsu-POST-200]
module.svep[0].aws_api_gateway_integration_response.vcfstats-patch: Refreshing state... [id=agir-pihbmfom84-t1qsgu-PATCH-200]
module.svep[0].aws_api_gateway_integration_response.results-get: Refreshing state... [id=agir-pihbmfom84-vu4rlt-GET-200]
module.svep[0].aws_sns_topic_subscription.pluginGnomadOneKG: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomadOneKG:deff122c-bdf2-48b6-ad80-fc5ae4f8c7ff]
module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_one_kg_invoke_permission: Refreshing state... [id=SNSPluginGnomadAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.create_pages_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.create_pages_invoke_permission: Refreshing state... [id=SNSCreatePagesAllowInvoke]
module.svep[0].aws_sns_topic_subscription.createPages: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-createPages:a810ded3-1617-4f5a-880c-c2b141902346]
module.svep[0].aws_api_gateway_integration_response.qcnotes-get: Refreshing state... [id=agir-pihbmfom84-5yb9hf-GET-200]
module.svep[0].aws_api_gateway_integration.submit-post: Refreshing state... [id=agi-pihbmfom84-g7sppc-POST]
module.svep[0].aws_api_gateway_integration.submit-patch: Refreshing state... [id=agi-pihbmfom84-g7sppc-PATCH]
module.svep[0].aws_sns_topic_subscription.initQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-initQuery:1f4427e4-9d4b-4054-bae5-94b307020592]
module.svep[0].aws_lambda_function_recursion_config.init_query_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.init_query_invoke_permission: Refreshing state... [id=APIInitQueryAllowInvoke]
module.svep[0].aws_lambda_permission.initquery_invoke_permission_sns: Refreshing state... [id=SNSInitQueryAllowInvoke]
module.svep[0].aws_sns_topic_subscription.queryVCFsubmit: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryVCFsubmit:a1bdf212-4003-4dc2-99b2-6f9859f8d00f]
module.svep[0].aws_lambda_permission.query_vcf_submit_invoke_permission: Refreshing state... [id=SNSQueryVCFSubmitAllowInvoke]
module.svep[0].aws_sns_topic_subscription.queryGTF: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryGTF:e0d0b0a4-3ee4-4dd6-bf2b-3485cd136e2e]
module.svep[0].aws_lambda_function_recursion_config.query_gtf_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.query_gtf_invoke_permission: Refreshing state... [id=SNSQueryGTFAllowInvoke]
module.svep[0].aws_lambda_permission.plugin_consequence_invoke_permission: Refreshing state... [id=SNSPluginConsequenceAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.plugin_consequence_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.pluginConsequence: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginConsequence:dae37282-6f6c-4cc6-83c5-3881810f7d4c]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration._: Refreshing state... [id=agi-auudf51p4c-fljl4i4t93-OPTIONS]
module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._: Refreshing state... [id=agmr-auudf51p4c-fljl4i4t93-OPTIONS-200]
module.sbeacon.aws_api_gateway_method_response.datasets: Refreshing state... [id=agmr-auudf51p4c-o1bur6-GET-200]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.svep[0].aws_api_gateway_integration_response.submit-post: Refreshing state... [id=agir-pihbmfom84-g7sppc-POST-200]
module.sbeacon.aws_api_gateway_integration.filtering_terms: Refreshing state... [id=agi-auudf51p4c-jzqmn2-GET]
module.sbeacon.aws_api_gateway_method_response.filtering_terms: Refreshing state... [id=agmr-auudf51p4c-jzqmn2-GET-200]
module.svep[0].aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-pihbmfom84-g7sppc-PATCH-200]
module.sbeacon.aws_api_gateway_integration_response.configuration: Refreshing state... [id=agir-auudf51p4c-xvqnjq-GET-200]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-auudf51p4c-fljl4i4t93-OPTIONS-200]
module.sbeacon.aws_api_gateway_integration_response.filtering_terms: Refreshing state... [id=agir-auudf51p4c-jzqmn2-GET-200]
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:460722568061:splitQuery:d63f3a2c-0cff-4303-88c8-aafde1c5574a]
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-auudf51p4c-o542q0-ANY]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-auudf51p4c-o542q0-ANY-200]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-auudf51p4c-3vivi6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-auudf51p4c-y5t5hi-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-auudf51p4c-vqjww2-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-ubnq59-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-auudf51p4c-o1bur6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-y5t5hi-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-auudf51p4c-ubnq59-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-auudf51p4c-tx4nza-GET]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-auudf51p4c-o1bur6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-auudf51p4c-fyhv7o-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-3vivi6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-tx4nza-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-jnmq3v-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-ho1m5d-POST]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-auudf51p4c-j5giw6-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-auudf51p4c-kga52w-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-vqjww2-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-auudf51p4c-jnmq3v-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-auudf51p4c-fyhv7o-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-auudf51p4c-kga52w-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-auudf51p4c-ho1m5d-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-auudf51p4c-yoq0wr-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-yoq0wr-POST]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-auudf51p4c-j5giw6-POST]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-ubnq59-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-auudf51p4c-vqjww2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-auudf51p4c-y5t5hi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-auudf51p4c-3vivi6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-auudf51p4c-o1bur6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-y5t5hi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-auudf51p4c-ubnq59-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-auudf51p4c-tx4nza-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-auudf51p4c-o1bur6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-auudf51p4c-fyhv7o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-3vivi6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-ho1m5d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-jnmq3v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-auudf51p4c-kga52w-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-tx4nza-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-auudf51p4c-j5giw6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-vqjww2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-auudf51p4c-fyhv7o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-auudf51p4c-jnmq3v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-auudf51p4c-kga52w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-auudf51p4c-yoq0wr-GET-200]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-auudf51p4c-ho1m5d-GET-200]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-auudf51p4c-sjks3s-GET]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-auudf51p4c-u79iwd-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-facarh-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-nb8c7s-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-auudf51p4c-facarh-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-auudf51p4c-sjks3s-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-auudf51p4c-3jtaho-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-3jtaho-POST]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-auudf51p4c-zjwczl-ANY]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-auudf51p4c-u79iwd-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-auudf51p4c-nb8c7s-GET]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-yoq0wr-POST-200]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-auudf51p4c-j0sm1h-POST]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-nftwai-POST]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-auudf51p4c-zajmnx-GET]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-auudf51p4c-budf3y-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-auudf51p4c-19r55o-GET]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-auudf51p4c-budf3y-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-auudf51p4c-3n9fhg-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-19r55o-POST]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-auudf51p4c-1yp0in-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-auudf51p4c-j0sm1h-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-auudf51p4c-3n9fhg-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-auudf51p4c-q1jifp-POST]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-zajmnx-POST]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-auudf51p4c-6bnaby-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-pgsebc-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-1yp0in-POST]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-auudf51p4c-6bnaby-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-auudf51p4c-q1jifp-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-auudf51p4c-nftwai-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-auudf51p4c-pgsebc-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-auudf51p4c-j5giw6-POST-200]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-auudf51p4c-3o2mt5-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-vxkjof-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-auudf51p4c-1q0gx4-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-auudf51p4c-a62i9b-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-auudf51p4c-vxkjof-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-auudf51p4c-3o2mt5-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-a62i9b-POST]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-auudf51p4c-u79iwd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-facarh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-nb8c7s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-3jtaho-POST-200]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-auudf51p4c-zjwczl-ANY-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-auudf51p4c-nb8c7s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-auudf51p4c-u79iwd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-auudf51p4c-sjks3s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-auudf51p4c-j0sm1h-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-nftwai-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-auudf51p4c-zajmnx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-auudf51p4c-budf3y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-auudf51p4c-3jtaho-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-auudf51p4c-19r55o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-auudf51p4c-3n9fhg-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-auudf51p4c-budf3y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-19r55o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-auudf51p4c-1yp0in-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-auudf51p4c-j0sm1h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-auudf51p4c-3n9fhg-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-auudf51p4c-q1jifp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-zajmnx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-auudf51p4c-6bnaby-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-auudf51p4c-facarh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-pgsebc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-1yp0in-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-auudf51p4c-q1jifp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-auudf51p4c-6bnaby-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-auudf51p4c-nftwai-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-auudf51p4c-pgsebc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-auudf51p4c-3o2mt5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-auudf51p4c-1q0gx4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-vxkjof-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-auudf51p4c-vxkjof-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-auudf51p4c-a62i9b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-a62i9b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-auudf51p4c-3o2mt5-GET-200]
module.svep[0].aws_api_gateway_deployment.VPApi: Refreshing state... [id=3trr1a]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-pihbmfom84-prod]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=pihbmfom84-prod-*/*]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2VOWED91CBL3B]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-auudf51p4c-sjks3s-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses_post: Refreshing state... [id=agmr-auudf51p4c-1q0gx4-POST-200]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-auudf51p4c-1q0gx4-POST]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-auudf51p4c-1q0gx4-POST-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=axo133]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-auudf51p4c-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=auudf51p4c-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1ACA5WT51ELER]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=b8634475-d812-42ad-9dde-cd31725a80cb]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E8Z5K385KM143]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=532d5978-311a-fbf1-7896-c9d3eaff379a]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250513021738584800000001]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-auudf51p4c-vqjww2-OPTIONS-200]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Read complete after 1m20s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=198888135352420537]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=2522651683204420350]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has changed
  ~ resource "docker_image" "this" {
        id           = "sha256:688ec4fa8c04014a3e9af73c9f64c51912eaa58133eaae18ea912caf4cafd76b460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ image_id     = "sha256:688ec4fa8c04014a3e9af73c9f64c51912eaa58133eaae18ea912caf4cafd76b" -> "sha256:3bd68e808dddb75d3498098675b2bdb096e5d3f4c8f461b93c2b6adc719a7d23"
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has changed
  ~ resource "docker_image" "this" {
        id           = "sha256:3850184da3a6d56689e83e6a2fc01ed648ad07ab84d11441b2a04aa8c613fd1e460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ image_id     = "sha256:3850184da3a6d56689e83e6a2fc01ed648ad07ab84d11441b2a04aa8c613fd1e" -> "sha256:cf6cb26cc7765b6fe51c622f3d2ce66feb77c2216db68a8c3bd6431a454250e1"
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has changed
  ~ resource "docker_image" "this" {
        id           = "sha256:58e4aea3dd0c00866cbf0a0ccc98d56ed76bddbffa179a2c1cf5823ab0e48d28460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ image_id     = "sha256:58e4aea3dd0c00866cbf0a0ccc98d56ed76bddbffa179a2c1cf5823ab0e48d28" -> "sha256:cbc442f3fa6570c26a617a46fd9b6b48f544062919bedc0803b598d8bc344b60"
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_backup_plan.gaspi_backup_plan will be updated in-place
  ~ resource "aws_backup_plan" "gaspi_backup_plan" {
        id       = "1c1a5178-6b59-4f27-b82b-48ada54b30fb"
        name     = "gaspi_backup_plan"
      ~ tags     = {
          ~ "Environment" = "dev" -> "uat"
            "Owner"       = "gaspi"
        }
      ~ tags_all = {
          ~ "Environment" = "dev" -> "uat"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_backup_vault.gaspi_backup_vault will be updated in-place
  ~ resource "aws_backup_vault" "gaspi_backup_vault" {
        id              = "gaspi_backup_vault"
        name            = "gaspi_backup_vault"
      ~ tags            = {
          ~ "Environment" = "dev" -> "uat"
            "Owner"       = "gaspi"
        }
      ~ tags_all        = {
          ~ "Environment" = "dev" -> "uat"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:sesDeliveryLogger",
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "460722568061",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be updated in-place
  ~ resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
        id                               = "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0"
      ~ tags                             = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all                         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "gaspi_user_pool" {
        id                         = "ap-southeast-3_TxZFmgKtd"
        name                       = "gaspi-users"
      ~ tags                       = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all                   = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "admin_group_role_policy" {
        id               = "arn:aws:iam::460722568061:policy/gaspi-admin-group-role-policy"
        name             = "gaspi-admin-group-role-policy"
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "manager_group_role_policy" {
        id               = "arn:aws:iam::460722568061:policy/gaspi-manager-group-role-policy"
        name             = "gaspi-manager-group-role-policy"
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.admin_group_role will be updated in-place
  ~ resource "aws_iam_role" "admin_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-admin-group-role"
        name                  = "gaspi-admin-group-role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_authenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_authenticated"
        name                  = "gaspi_authenticated"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_unauthenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "unauthenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_unauthenticated"
        name                  = "gaspi_unauthenticated"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.manager_group_role will be updated in-place
  ~ resource "aws_iam_role" "manager_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:52671ec7-c61c-4eeb-be58-1cf8220c3be0"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-manager-group-role"
        name                  = "gaspi-manager-group-role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic" "sesDeliveryLogger" {
        id                                       = "arn:aws:sns:ap-southeast-3:460722568061:sesDeliveryLogger"
        name                                     = "sesDeliveryLogger"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic_policy" "sesDeliveryLogger" {
        id     = "arn:aws:sns:ap-southeast-3:460722568061:sesDeliveryLogger"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "460722568061"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ses.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:460722568061:sesDeliveryLogger"
                      - Sid       = "AllowSESToPublishToSNS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.error-catcher.data.aws_iam_policy_document.lambda-notifyOnError will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-notifyOnError" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:DescribeAlarms",
            ]
          + resources = [
              + "arn:aws:cloudwatch:ap-southeast-3:460722568061:alarm:error-catcher-notifyOnError",
            ]
        }
      + statement {
          + actions   = [
              + "events:describeRule",
              + "events:disableRule",
              + "events:enableRule",
            ]
          + resources = [
              + "arn:aws:events:ap-southeast-3:460722568061:rule/error-catcher-notifyOnError-trigger",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::error-catcher-recent-errors-20250707235458704700000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::error-catcher-recent-errors-20250707235458704700000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricData",
              + "cloudwatch:ListMetrics",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:FilterLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:ap-southeast-3:460722568061:log-group:/aws/lambda/*",
            ]
        }
      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:460722568061:configuration-set/*",
              + "arn:aws:ses:ap-southeast-3:460722568061:identity/*",
            ]
        }
    }

  # module.error-catcher.aws_cloudwatch_event_rule.notifyOnError-trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "notifyOnError-trigger" {
        id                  = "error-catcher-notifyOnError-trigger"
        name                = "error-catcher-notifyOnError-trigger"
      ~ tags                = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all            = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.error-catcher.aws_cloudwatch_metric_alarm.notifyOnError-alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "notifyOnError-alarm" {
        id                                    = "error-catcher-notifyOnError"
      ~ tags                                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # module.error-catcher.aws_s3_bucket.recent-errors will be updated in-place
  ~ resource "aws_s3_bucket" "recent-errors" {
        id                          = "error-catcher-recent-errors-20250707235458704700000001"
      ~ tags                        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.error-catcher.aws_sns_topic.notifyOnError will be updated in-place
  ~ resource "aws_sns_topic" "notifyOnError" {
        id                                       = "arn:aws:sns:ap-southeast-3:460722568061:error-catcher-notifyOnError"
        name                                     = "error-catcher-notifyOnError"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-info",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:StopNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:460722568061:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendRegistrationEmail",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:460722568061:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-metadata-20250513021731641000000004",
              + "arn:aws:s3:::gasi-metadata-20250513021731641000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:460722568061:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
              +
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.